# Meeting 22-June-2021

## Attendees 

- Pablo
- Jorge
- Guillermo
- Labra
- Dani

## Done

- Jorge was working optimizing subqueries. Country-authors.
- Pablo discovered the reason why the queries return a different number of items locally.

## Discussions

- Pablo

```sparql

# Initial data
:Q1 :P1416 :Q2 .
:Q2 :P17   :Q3 .

:Q1 :P1416 :Q4 .
:Q4 :P17   :Q5 .
:Q1 :P27   :Q6 .

# 1.- Original query on wikidata: 
# select * where { ?x :P27 | :P1416/:P17 ?y }
# Nodes that are stored: :Q1, :Q3, :Q5, :Q6
# 2.- A new query on subset
# select * where { ?x :P27 | :P1416/:P17 ?y }
# Nodes that are retrieved
# :Q6

# Approach 1: Query rewriting

select * where { 
  { ?x :P27 ?y } 
 UNION {
    ?x      :P1416 ?aux_1 .
    ?aux_1  :P17 ?y
 }
}

Paper about property paths: https://dvrgoc.ing.puc.cl/data/ppath_ex.pdf

# Approach 2: Auxiliary property

# Create an auxiliary property

# 1.- Query on wikidata

construct { 
  ?x :P21 ?y .
  ?x :P1416_P17 ?z 
} where { 
 ?x :P27 | :P1416/:P17 ?y 
}

# Subset
:Q1 :P1416_P17 :Q3 .
:Q1 :P1416_P17 :Q5 .
:Q1 :P27   :Q6 .

# Nodes that are stored: :Q1, :Q3, :Q5, :Q6

# 2.- Query reqritten on subset as:
select * where { 
  ?x :P21 ?y | :P1416_P17 ?z 
}

# Expected results:
:Q1, :Q3, :Q5, :Q6
```

## Tasks
- Guillermo: Explore the federated properties from Wikidata.
- Guillermo: Write down the hardware specification that is need in order to handle the Wikidata dumps datasets.
- Pablo: Create a subset with the new rewritten query
- Pablo: Explore wikidata toolkit tool
